// src/data/indicationCategories.js
// indicationCategories 是一个对象，表示不同系统的症状（indications）分类

const indicationCategories = {
  "全身症状": ["发热", "发热（高热）", "营养不良", "脱水表现", "寒颤", "头痛", "偏头痛", "头晕", "四肢酸痛（感冒相关）", "乏力", "失眠", "浑身酸痛", "精神抑郁", "急躁易怒", "盗汗", "厌食"],
  "消化系统症状": ["积食", "食欲不振", "嗳气", "反酸", "胃胀", "胃痛", "烧心", "呕吐", "胃灼痛", "饱胀", "早饱", "恶心", "消化不良", "腹胀", "腹泻", "胁痛", "便秘", "胃部不适", "胃肠道绞痛", "胆绞痛", "胃酸过多", "肾绞痛", "溃疡", "瘘管"],
  "呼吸系统症状": ["打喷嚏", "鼻痒", "流鼻涕（清水样）", "流鼻涕（粘液脓性）", "鼻塞", "嗅觉迟钝", "咳嗽（干咳少痰）", "咳嗽（湿咳）", "咳痰（黏稠）", "咳痰（稀薄）", "气喘", "胸闷", "咽痛", "咽干", "声音嘶哑", "咳痒", "咽痒"],
  "口腔症状": ["口腔溃疡", "牙龈肿痛", "牙痛", "口苦", "口干"],
  "眼部症状": ["眼部干涩", "异物感", "眼疲劳", "结膜充血", "眼痒", "目赤肿痛", "眼部痒及烧灼感"],
  "耳部症状": ["耳痛", "耳鸣"],
  "皮肤症状": ["皮肤瘙痒", "皮疹", "红肿热痛", "痱子", "荨麻疹", "局部瘀血肿胀", "头皮脱屑", "头皮瘙痒"],
  "神经系统症状": ["眩晕", "神经痛", "健忘", "晕动症（晕车、晕机、晕船）", "眩晕（前庭功能紊乱导致的）"],
  "疼痛症状": ["疼痛（软组织和骨关节）", "疼痛（骨关节）", "疼痛（风湿性）", "疼痛（神经性）", "疼痛（腰肩背）", "疼痛（软组织：肌肉、筋膜）", "疼痛（术后）"],
  "运动系统症状": ["关节肿胀", "关节僵硬", "骨质疏松"],
  "肛肠症状": ["便血", "痔血", "肛门瘙痒", "肛周湿疹", "肛门灼热", "痔疮", "肛裂"],
  "血液相关症状": ["吐血", "咳血", "出血", "呕血", "手术出血", "静脉曲张"],
  "泌尿系统症状": ["尿黄", "尿血"],
  "免疫与过敏症状": ["过敏", "蚊虫叮咬"],
  "感染症状": ["感染（皮肤）", "感染（眼部）", "急性咽炎", "扁桃腺炎", "清热解毒"],
  "妇科症状": ["痛经"],
  "其他症状": ["餐后高血糖"]
};

// 导出 indicationCategories 以便在其他模块中使用
export default indicationCategories;
